Revit 2024 API
FabricationConfigurationInfo.GetAllFabricationConfigurations Method
 Gets all added fabrication configurations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public static IList<FabricationConfigurationInfo> GetAllFabricationConfigurations()
Visual Basic
Public Shared Function GetAllFabricationConfigurations As IList(Of FabricationConfigurationInfo)
Visual C++
public:
static IList<FabricationConfigurationInfo^>^ GetAllFabricationConfigurations()
Return Value
 All added fabrication configurations.
See Also
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace